#include <stdio.h>                                                                  //вкарвате библиотеката stdio.h

#define CLASS_SIZE 5                                                                //дефинирате константа


int main () {                                                                       //започвате main функцията
    enum classes { MATH, BG, PROGRAMMING };                                         //дефинирате учебните предмети БГ,МАТ и Програмиране под една група наречена classes
    int scores[PROGRAMMING + 1][CLASS_SIZE];                                        //създавате масив, в който да се съжраняват оценки на 5 ученика по 4 учебни предмета
    int i = -1;                                                                     //декларирате i като цяло число, което да е равно на -1
    char c;                                                                         //създавате буква под името c
    char subject;                                                                   //създавате буква под името subject

    // M 4 3 2 5 6 B 54333 P 43546

   while ((i < CLASS_SIZE * (PROGRAMMING + 1)+2) && (c = getchar()) != EOF) {       //докато i е по-голямо от CLASS_SIZE по PROGRAMMING, плюс 1 и c не е празна променлива, ще се извършва кода в while конструкцията CURIGIRAL SUM BROJ POVTORENIJA VUV WHILE
        if (c == 'M' || c == 'B' || c == 'P') {                                     //ще се изпълни кода в if конструкцията ако c e равно M или B или P
            subject = c;                                                            //subject е равно на c
            i++;                                                                    //i се увеличава с 1
        }                                                                           //свършва if конструкцията

        if (c > 49 && c <= '6') {                                                   //ще се изпълни кода в if конструкцията ако c е по-голямо от 2 (49 в ASCII) и е по-малко или равно от 6

            if (subject == 'M') {                                                   //ще се изпълни кода в if конструкцията ако subject е равно на M
                scores[MATH][i] = c - '0';                                          //в елемент със съответно индекси MATH и i от масива scores ще се вкара стойноста на c минус 0
            }                                                                       //свършва if конструкцията
            if (subject == 'B') {                                                   //ще се изпълни кода в if конструкцията ако subject е равно на B
                scores[BG][i-6] = c - '0';                                            //в елемент със съответно индекси BG и i от масива scores ще се вкара стойноста на c минус 0 CURIGIRAL SUM INDEKS
            }                                                                       //свършва if конструкцията
            if (subject == 'P') {                                                   //ще се изпълни кода в if конструкцията ако subject е равно на P
                scores[PROGRAMMING][i-12] = c - '0';                                   //в елемент със съответно индекси PROGRAMMING и i от масива scores ще се вкара стойноста на c минус 0 CURIGIRAL SUM INDEKS
            }                                                                       //свършва if конструкцията

            i++;                                                                    //i се увеличава с 1
        }                                                                           //свършва if конструкцията((c > 49 && c <= '6'))
    }                                                                               //свършва while конструкцията((i < CLASS_SIZE * PROGRAMMING + 1) && (c = getchar()) != EOF)

    for (i = 0; i < PROGRAMMING + 1; ++i) {                                         //ще се изпълнява кода във for конструкцията докато i е по-малко от PROGRAMMING плюс 1 и всеки път когато се терминира отново i се увеличава с 1
        for(int j = 0; j < CLASS_SIZE; j++) {                                       //ще се изпълнява кода във for конструкцията докато j е по-малко от PROGRAMMING плюс 1 и всеки път когато се терминира отново j се увеличава с 1
            printf("%d ", scores[i][j]);                                            //изписва се елемент от масива scores със съответно индексите i и j
        }                                                                           //свършва for конструкцията((int j = 0; j < CLASS_SIZE; j++))
    }                                                                               //свършва for конструкцията((i = 0; i < PROGRAMMING + 1; ++i))

    return 0;                                                                       //програмата се връща в началото на main функцията
}
